InformationRegisters/ОсновныеТелефоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеТелефоны</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СлужебныеSIMКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Привязка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользованияSIMКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОсновныеТелефоны/Ext/RecordSetModule.bsl
//+++ АК BARA ИП-00015876.000.00000001
Процедура ПриЗаписи(Отказ, Замещение)
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Назначение = Справочники.НазначенияИспользованияSIMКарт.НайтиПоКоду("000000001");
		Для каждого Стр Из Этотобъект Цикл			
			Если Этотобъект[0].Назначение = Назначение и Этотобъект[0].Привязка.ТелефонныйНомер1 <>  Сред(Этотобъект[0].Телефон.Код,2,10) Тогда
				СтрукЕд = Этотобъект[0].Привязка.ПолучитьОбъект();
				СтрукЕд.ТелефонныйНомер1 =  Сред(Этотобъект[0].Телефон.Код,2,10);
				СтрукЕд.Записать();
			КонецЕсли;			
		КонецЦикла;
	Исключение
	КонецПопытки;	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
//--- АК BARA ИП-00015876.000.00000001
